function f = model_ex2(t,IN)
f = zeros(6,1);

%パラメータ設定
ka1 = 10.0;
ka2 = 12.0;
ka3 = 14.0;
ka4 = 15.0;
kd1 = 10.0;
kd2 = 15.0;
kd3 = 15.0;
kd4 = 15.0;

%わかりやすくするためモデルのタンパク質名に置き換える
x1 = IN(1);
x2 = IN(2);
x3 = IN(3);
x4 = IN(4);
x5 = IN(5);
x6 = IN(6);

%反応速度式を記述
v1 = ka1 * x1 * x2 - kd1 * x3;
v2 = ka2 * x3 * x4 - kd2 * x5;
v3 = kd3 * x5 - ka3 * x1 * x6;
v4 = kd4 * x6 - ka4 * x2 * x4;

%微分方程式の右辺を記述
f(1) = -v1;
f(2) = -v1 + v4;
f(3) = +v1 - v2;
f(4) = -v2 + v4;
f(5) = +v2 - v3;
f(6) = +v3 - v4;
