function f = model_ex3(t,IN)
f = zeros(7,1);
global K1;

%パラメータ設定
k1 = 10.0;
k3 = 12.0;
k5 = 10.0;
K2 = 5.0;
K3 = 10.0;
K4 = 10.0;
V2 = 5.0;
V4 = 5.0;
K5 = 5.0;
K6 = 10.0;
V6 = 2.5;
Ki = 2.0;


%わかりやすくするためモデルのタンパク質名に置き換える
x1 = IN(1);
x2 = IN(2);
x3 = IN(3);
x4 = IN(4);
x5 = IN(5);
x6 = IN(6);
y = IN(7);

%反応速度式を記述
v1 = k1 * y * x1 / ((K1 + x1)*(1 + x6 / Ki));
v2 = V2 * x2 / (K2 + x2);
v3 = k3 * x2 * x3 / (K3 + x3);
v4 = V4 * x4 / (K4 + x4);
v5 = k5 * x4 * x5 / (K5 + x5);
v6 = V6 * x6 / (K6 + x6);

%微分方程式の右辺を記述
f(1) = -v1 + v2;
f(2) = +v1 - v2;
f(3) = -v3 + v4;
f(4) = +v3 - v4;
f(5) = -v5 + v6;
f(6) = +v5 - v6;
f(7) = 0; 